# 01. Import libraries

In [1]:
# Import libraries
import pandas as pd
import numpy as np
import os

# 02. Import and analyze data

In [2]:
# Define path
path = r'/Users/elisabetta/Documents/12-2022 Instacart Basket Analysis'

In [3]:
# Import orders_products_merged_3.pkl and customers.csv
df_ords_prods_merged_3 = pd.read_pickle(os.path.join(path, '02 Data', 'Prepared Data', 'orders_products_merged_3.pkl'))
df_cust = pd.read_csv(os.path.join(path, '02 Data', 'Original Data', 'customers.csv'))

In [4]:
# First check df_ords_prods_merged_3 to make sure it's reday for merge with df_cust
df_ords_prods_merged_3.shape

(32404854, 23)

In [5]:
df_ords_prods_merged_3.head()

,order_id,user_id,number_of_orders,order_day_of_week,order_hour_of_day,days_since_prior_order,product_id,add_to_cart_order,reordered,product_name,...,price_range,busy_day,busy_day_2,busiest_period_of_day,max_number_of_orders,loyalty_flag,avg_spend,spend_flag,median_d_s_p_o,frequency_flag
0,2539329,1,1,2,8,NaN,196,1,0,Soda,...,Medium,Regularly busy,Regularly busy,Average orders,10,New customer,6.367797,Low spender,20.5,Non-frequent customer
1,2398795,1,2,3,7,15.0,196,1,1,Soda,...,Medium,Regularly busy,Least busy,Average orders,10,New customer,6.367797,Low spender,20.5,Non-frequent customer
2,473747,1,3,3,12,21.0,196,1,1,Soda,...,Medium,Regularly busy,Least busy,Most orders,10,New customer,6.367797,Low spender,20.5,Non-frequent customer
3,2254736,1,4,4,7,29.0,196,1,1,Soda,...,Medium,Least busy,Least busy,Average orders,10,New customer,6.367797,Low spender,20.5,Non-frequent customer
4,431534,1,5,4,15,28.0,196,1,1,Soda,...,Medium,Least busy,Least busy,Most orders,10,New customer,6.367797,Low spender,20.5,Non-frequent customer

In [6]:
# Drop columns that are not necessary to answer questions in project brief
df_ords_prods_merged_3 = df_ords_prods_merged_3.drop(columns = ['busy_day_2', 'max_number_of_orders', 'avg_spend', 'median_d_s_p_o', 'add_to_cart_order', 'reordered', 'aisle_id'])

In [7]:
# Check output
df_ords_prods_merged_3.shape

(32404854, 16)

In [8]:
df_ords_prods_merged_3.head()

,order_id,user_id,number_of_orders,order_day_of_week,order_hour_of_day,days_since_prior_order,product_id,product_name,department_id,price,price_range,busy_day,busiest_period_of_day,loyalty_flag,spend_flag,frequency_flag
0,2539329,1,1,2,8,NaN,196,Soda,7,9.0,Medium,Regularly busy,Average orders,New customer,Low spender,Non-frequent customer
1,2398795,1,2,3,7,15.0,196,Soda,7,9.0,Medium,Regularly busy,Average orders,New customer,Low spender,Non-frequent customer
2,473747,1,3,3,12,21.0,196,Soda,7,9.0,Medium,Regularly busy,Most orders,New customer,Low spender,Non-frequent customer
3,2254736,1,4,4,7,29.0,196,Soda,7,9.0,Medium,Least busy,Average orders,New customer,Low spender,Non-frequent customer
4,431534,1,5,4,15,28.0,196,Soda,7,9.0,Medium,Least busy,Most orders,New customer,Low spender,Non-frequent customer

In [9]:
# Check data types df_ords_prods_merged_3
df_ords_prods_merged_3.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 32404854 entries, 0 to 32404858
Data columns (total 16 columns):
 #   Column                  Dtype
---  ------                  -----
 0   order_id                int64
 1   user_id                 int64
 2   number_of_orders        int64
 3   order_day_of_week       int64
 4   order_hour_of_day       int64
 5   days_since_prior_order  float64
 6   product_id              int64
 7   product_name            object
 8   department_id           int64
 9   price                   float64
 10  price_range             object
 11  busy_day                object
 12  busiest_period_of_day   object
 13  loyalty_flag            object
 14  spend_flag              object
 15  frequency_flag          object
dtypes: float64(2), int64(7), object(7)
memory usage: 4.1+ GB

In [10]:
# Change data type user_id
df_ords_prods_merged_3['user_id'] = df_ords_prods_merged_3['user_id'].astype('str')

In [11]:
# Change data type order_id
df_ords_prods_merged_3['order_id'] = df_ords_prods_merged_3['order_id'].astype('str')

In [12]:
# Change data type product_id
df_ords_prods_merged_3['product_id'] = df_ords_prods_merged_3['product_id'].astype('str')

In [13]:
# Change data type department_id
df_ords_prods_merged_3['department_id'] = df_ords_prods_merged_3['department_id'].astype('str')

In [14]:
# Check output
df_ords_prods_merged_3.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 32404854 entries, 0 to 32404858
Data columns (total 16 columns):
 #   Column                  Dtype
---  ------                  -----
 0   order_id                object
 1   user_id                 object
 2   number_of_orders        int64
 3   order_day_of_week       int64
 4   order_hour_of_day       int64
 5   days_since_prior_order  float64
 6   product_id              object
 7   product_name            object
 8   department_id           object
 9   price                   float64
 10  price_range             object
 11  busy_day                object
 12  busiest_period_of_day   object
 13  loyalty_flag            object
 14  spend_flag              object
 15  frequency_flag          object
dtypes: float64(2), int64(3), object(11)
memory usage: 4.1+ GB

In [15]:
# Check further
df_ords_prods_merged_3.describe()

,number_of_orders,order_day_of_week,order_hour_of_day,days_since_prior_order,price
count,3.240485e+07,3.240485e+07,3.240485e+07,3.032876e+07,3.240485e+07
mean,1.714231e+01,2.738867e+00,1.342515e+01,1.110408e+01,1.198023e+01
std,1.753532e+01,2.090077e+00,4.246380e+00,8.779064e+00,4.956555e+02
min,1.000000e+00,0.000000e+00,0.000000e+00,0.000000e+00,1.000000e+00
25%,5.000000e+00,1.000000e+00,1.000000e+01,5.000000e+00,4.200000e+00
50%,1.100000e+01,3.000000e+00,1.300000e+01,8.000000e+00,7.400000e+00
75%,2.400000e+01,5.000000e+00,1.600000e+01,1.500000e+01,1.130000e+01
max,9.900000e+01,6.000000e+00,2.300000e+01,3.000000e+01,9.999900e+04

In [16]:
# Now check customers.csv

In [17]:
df_cust.shape

(206209, 10)

In [18]:
df_cust.head()

,user_id,First Name,Surnam,Gender,STATE,Age,date_joined,n_dependants,fam_status,income
0,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Patricia,Hart,Female,New Mexico,36,1/1/2017,0,single,59285
2,65803,Kenneth,Farley,Male,Idaho,35,1/1/2017,2,married,99568
3,125935,Michelle,Hicks,Female,Iowa,40,1/1/2017,0,single,42049
4,130797,Ann,Gilmore,Female,Maryland,26,1/1/2017,1,married,40374

In [19]:
# Rename column First Name
df_cust.rename(columns = {'First Name' : 'first_name'}, inplace = True)

In [20]:
# Rename column Surnam
df_cust.rename(columns = {'Surnam' : 'second_name'}, inplace = True)

In [21]:
# Rename column Gender
df_cust.rename(columns = {'Gender' : 'gender'}, inplace = True)

In [22]:
# Rename column STATE
df_cust.rename(columns = {'STATE' : 'state'}, inplace = True)

In [23]:
# Rename column Age
df_cust.rename(columns = {'Age' : 'age'}, inplace = True)

In [24]:
# Check output
df_cust.head()

,user_id,first_name,second_name,gender,state,age,date_joined,n_dependants,fam_status,income
0,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Patricia,Hart,Female,New Mexico,36,1/1/2017,0,single,59285
2,65803,Kenneth,Farley,Male,Idaho,35,1/1/2017,2,married,99568
3,125935,Michelle,Hicks,Female,Iowa,40,1/1/2017,0,single,42049
4,130797,Ann,Gilmore,Female,Maryland,26,1/1/2017,1,married,40374

In [25]:
# Drop date_joined as we already created a flag to classify new vs. returning customers
df_cust = df_cust.drop(columns = ['date_joined'])

In [26]:
# Check output
df_cust.head()

,user_id,first_name,second_name,gender,state,age,n_dependants,fam_status,income
0,26711,Deborah,Esquivel,Female,Missouri,48,3,married,165665
1,33890,Patricia,Hart,Female,New Mexico,36,0,single,59285
2,65803,Kenneth,Farley,Male,Idaho,35,2,married,99568
3,125935,Michelle,Hicks,Female,Iowa,40,0,single,42049
4,130797,Ann,Gilmore,Female,Maryland,26,1,married,40374

In [27]:
# Look for missing values
df_cust['fam_status'].value_counts(dropna = False)

married                             144906
single                               33962
divorced/widowed                     17640
living with parents and siblings      9701
Name: fam_status, dtype: int64

In [28]:
df_cust['n_dependants'].value_counts(dropna = False)

0    51602
3    51594
1    51531
2    51482
Name: n_dependants, dtype: int64

In [29]:
df_cust['state'].value_counts(dropna = False)

Florida                 4044
Colorado                4044
Illinois                4044
Alabama                 4044
District of Columbia    4044
Hawaii                  4044
Arizona                 4044
Connecticut             4044
California              4044
Indiana                 4044
Arkansas                4044
Alaska                  4044
Delaware                4044
Iowa                    4044
Idaho                   4044
Georgia                 4044
Wyoming                 4043
Mississippi             4043
Oklahoma                4043
Utah                    4043
New Hampshire           4043
Kentucky                4043
Maryland                4043
Rhode Island            4043
Massachusetts           4043
Michigan                4043
New Jersey              4043
Kansas                  4043
South Dakota            4043
Minnesota               4043
Tennessee               4043
New York                4043
Washington              4043
Louisiana               4043
Montana                 4043
North Dakota            4043
Wisconsin               4043
Nebraska                4043
Vermont                 4043
Nevada                  4043
Maine                   4043
North Carolina          4043
West Virginia           4043
Virginia                4043
Oregon                  4043
New Mexico              4043
Texas                   4043
Pennsylvania            4043
Ohio                    4043
South Carolina          4043
Missouri                4043
Name: state, dtype: int64

In [30]:
df_cust['gender'].value_counts(dropna = False)

Male      104067
Female    102142
Name: gender, dtype: int64

In [31]:
# There are no relevant columns containing NaNs

In [32]:
# Check further
df_cust.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 206209 entries, 0 to 206208
Data columns (total 9 columns):
 #   Column        Non-Null Count   Dtype
---  ------        --------------   -----
 0   user_id       206209 non-null  int64
 1   first_name    194950 non-null  object
 2   second_name   206209 non-null  object
 3   gender        206209 non-null  object
 4   state         206209 non-null  object
 5   age           206209 non-null  int64
 6   n_dependants  206209 non-null  int64
 7   fam_status    206209 non-null  object
 8   income        206209 non-null  int64
dtypes: int64(4), object(5)
memory usage: 14.2+ MB

In [33]:
# Change data type user_id
df_cust['user_id'] = df_cust['user_id'].astype('str')

In [34]:
# Check output
df_cust.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 206209 entries, 0 to 206208
Data columns (total 9 columns):
 #   Column        Non-Null Count   Dtype
---  ------        --------------   -----
 0   user_id       206209 non-null  object
 1   first_name    194950 non-null  object
 2   second_name   206209 non-null  object
 3   gender        206209 non-null  object
 4   state         206209 non-null  object
 5   age           206209 non-null  int64
 6   n_dependants  206209 non-null  int64
 7   fam_status    206209 non-null  object
 8   income        206209 non-null  int64
dtypes: int64(3), object(6)
memory usage: 14.2+ MB

In [35]:
# Check dataframe main stats
df_cust.describe()

                 age   n_dependants         income
count  206209.000000  206209.000000  206209.000000
mean       49.501646       1.499823   94632.852548
std        18.480962       1.118433   42473.786988
min        18.000000       0.000000   25903.000000
25%        33.000000       0.000000   59874.000000
50%        49.000000       1.000000   93547.000000
75%        66.000000       3.000000  124244.000000
max        81.000000       3.000000  593901.000000

In [36]:
# Stats look plausible

In [37]:
# Check if other columns are nulls

In [38]:
df_cust['user_id'].isnull().sum()

0

In [39]:
df_cust['first_name'].isnull().sum()

11259

In [40]:
df_cust['second_name'].isnull().sum()

0

In [41]:
df_cust['income'].isnull().sum()

0

In [42]:
df_cust['age'].isnull().sum()

0

In [43]:
# Only first_name has nulls. We can still identify customers by user_id and second_name though, so no action needed

In [44]:
# Check for FULL ROWS that are duplicated
df_cust_dups = df_cust[df_cust.duplicated()]

In [45]:
df_cust_dups

Empty DataFrame
Columns: [user_id, first_name, second_name, gender, state, age, n_dependants, fam_status, income]
Index: []

In [46]:
# There are no duplicated rows

In [47]:
# Check if there are duplicated user IDs
df_cust.user_id.duplicated().sum()

0

# 03. Merge dataframes

In [48]:
# Merge dataframes df_ords_prods_merged_3 and df_cust on user_id
df_ords_prods_custs = df_ords_prods_merged_3.merge(df_cust, on = 'user_id', indicator = True)

In [49]:
# Check output
df_ords_prods_custs.head()

,order_id,user_id,number_of_orders,order_day_of_week,order_hour_of_day,days_since_prior_order,product_id,product_name,department_id,price,...,frequency_flag,first_name,second_name,gender,state,age,n_dependants,fam_status,income,_merge
0,2539329,1,1,2,8,NaN,196,Soda,7,9.0,...,Non-frequent customer,Linda,Nguyen,Female,Alabama,31,3,married,40423,both
1,2398795,1,2,3,7,15.0,196,Soda,7,9.0,...,Non-frequent customer,Linda,Nguyen,Female,Alabama,31,3,married,40423,both
2,473747,1,3,3,12,21.0,196,Soda,7,9.0,...,Non-frequent customer,Linda,Nguyen,Female,Alabama,31,3,married,40423,both
3,2254736,1,4,4,7,29.0,196,Soda,7,9.0,...,Non-frequent customer,Linda,Nguyen,Female,Alabama,31,3,married,40423,both
4,431534,1,5,4,15,28.0,196,Soda,7,9.0,...,Non-frequent customer,Linda,Nguyen,Female,Alabama,31,3,married,40423,both

In [50]:
df_ords_prods_custs['_merge'].value_counts()

both          32404854
left_only            0
right_only           0
Name: _merge, dtype: int64

In [51]:
df_ords_prods_custs.shape

(32404854, 25)

In [52]:
# Drop column _merge
df_ords_prods_custs = df_ords_prods_custs.drop(columns = ['_merge'])

In [53]:
# Check output
df_ords_prods_custs.shape

(32404854, 24)

In [54]:
df_ords_prods_custs.head()

,order_id,user_id,number_of_orders,order_day_of_week,order_hour_of_day,days_since_prior_order,product_id,product_name,department_id,price,...,spend_flag,frequency_flag,first_name,second_name,gender,state,age,n_dependants,fam_status,income
0,2539329,1,1,2,8,NaN,196,Soda,7,9.0,...,Low spender,Non-frequent customer,Linda,Nguyen,Female,Alabama,31,3,married,40423
1,2398795,1,2,3,7,15.0,196,Soda,7,9.0,...,Low spender,Non-frequent customer,Linda,Nguyen,Female,Alabama,31,3,married,40423
2,473747,1,3,3,12,21.0,196,Soda,7,9.0,...,Low spender,Non-frequent customer,Linda,Nguyen,Female,Alabama,31,3,married,40423
3,2254736,1,4,4,7,29.0,196,Soda,7,9.0,...,Low spender,Non-frequent customer,Linda,Nguyen,Female,Alabama,31,3,married,40423
4,431534,1,5,4,15,28.0,196,Soda,7,9.0,...,Low spender,Non-frequent customer,Linda,Nguyen,Female,Alabama,31,3,married,40423

# 04. Export file

In [55]:
# Export to pickle
df_ords_prods_custs.to_pickle(os.path.join(path, '02 Data','Prepared Data', 'orders_products_customers.pkl'))